Repository: zohar/illcom
Catalog: modules/acquia/mollom/translations/*.po
Languages: th

source: Allowing users to react, participate and contribute while still keeping your site's content under control can be a huge challenge. Mollom is a web service that helps you identify content quality and, more importantly, helps you stop spam. When content moderation becomes easier, you have more time and energy to interact with your web community. More information about Mollom is available on the <a href="@mollom-website">Mollom website</a> or in the <a href="@mollom-faq">Mollom FAQ</a>.
th: Mollom คือเว็บเซอร์วิสที่ช่วยคุณป้องกันสแปมโดยการวิเคราะห์จากเนื้อหาที่ถูกส่งเข้ามา เมื่อเนื้อหาได้ถูกตรวจตาให้ง่ายขึ้นนั้น คุณก็จะมีเวลาในการสร้างชุมชนในเว็บไซต์คุณ สำหรับข้อมูลเพิ่มเติมเกี่ยวกับ Mollom ดูได้ที่ <a href="@mollom-website">เว็บไซต์ Mollom</a> หรือที่ <a href="@mollom-faq">Mollom FAQ</a>

source: mark as abuse
th: กำหนดว่าเป็นการก่อกวน

source: Delete post
th: ลบข้อความ

source: use image CAPTCHA
th: ใช้ภาพ CAPTCHA

source: play audio CAPTCHA
th: เล่นเสียง CAPTCHA

source: Optionally report this to Mollom
th: อาจจะเลือกรายงานไปที่ Mollom

source: Don't send feedback to Mollom
th: ไม่ส่งฟีดแบ็กกลับไปที่ Mollom

source: Report as spam or unsolicited advertising
th: รายงานสแปม หรือโฆษณาที่ไม่ใช่ของไซต์

source: Report as obscene, violent or profane content
th: รายงานว่าเป็นเนื้อหาโป๊เปลือย เนื้อหารุนแรง หรือเนื้อหาที่มีคำหยาบ

source: Report as low-quality content or writing
th: รายงานว่าเป็นการเขียนหรือเนื้อหาคุณภาพต่ำ

source: Report as unwanted, taunting or off-topic content
th: รายงานว่าเป็น เนื้อหาที่ไม่ต้องการ เนื้อหาที่ล้อเลียน หรือเนื้อหาที่ไม่ออกนอกประเด็น

source: Mollom is a webservice that helps you moderate your site's content: see <a href="http://mollom.com">http://mollom.com</a> for more information. By sending feedback to Mollom, you teach Mollom what content you like and what content you dislike. Like that, Mollom can do a better job helping you to moderate your site's content.
th: Mollom เป็นบริการทางเว็บไซต์ที่ช่วยคุณตรวจตาเนื้อหาในเว็บไซต์คุณ ข้อมูลเพิ่มเติมดูได้ที่ <a href="http://mollom.com">http://mollom.com</a> ในการส่งฟีดแบ็กแต่ละครั้งกลับมาที่ Mollom คุณได้ช่วยสอน Mollom สำหรับรูปแบบในการตรวจตาเพิ่มขึ้น ซึ่งต่อไปในคราวหน้า Mollom สามารถทำงานตรวจตาเว็บไซต์คุณได้ดียิ่งขึ้น

source: Are you sure you want to delete the comment and report it?
th: ให้คุณแน่ใจว่าต้องการที่จะลบความเห็นนี้และรายงาน

source: This action cannot be undone.
th: คำสั่งนี้เมื่อทำแล้วไม่สามารถย้อนได้

source: Delete
th: ลบ

source: Cancel
th: ยกเลิก

source: The comment has been deleted.
th: ความเห็นได้ถูกลบ

source: Are you sure you want to delete %title and report it?
th: คุณแน่ใจว่าต้องการลบ %title และรายงานเรื่องนี้

source: Report as inappropriate: @link
th: รายงานว่าไม่เหมาะสม: @link

source: Are you sure you want to report the e-mail as inappropriate?
th: คุณแน่ใจว่าต้องการรายงานอีเมลนี้ว่าไม่เหมาะสม

source: Report as inappropriate
th: รายงานว่าไม่เหมาะสม

source: The e-mail has been reported as inappropriate.
th: อีเมลนี้ถูกแจ้งว่าไม่เหมาะสม

source: Report to Mollom as spam and unpublish
th: รายงานต่อ Mollom ว่าเป็นสแปมและยกเลิกการตีพิมพ์เนื้อหา

source: Report to Mollom as spam and delete
th: รายงานต่อ Mollom ว่าเป็นสแปมและลบเนื้อหาออก

source: The selected comments have been reported as inappropriate and are deleted.
th: ความเห็นที่เลือกได้ถูกรายงานว่าไม่เหมาะสมและถูกลบออก

source: The selected comments have been reported as inappropriate and are unpublished.
th: ความเห็นที่เลือกได้ถูกรายงานว่าไม่เหมาะสมและถูกนำออกจากการแสดงผล

source: The selected posts have been reported as inappropriate and are deleted.
th: ข้อความที่เลือกได้ถูกรายงานว่าไม่เหมาะสมและถูกลบออก

source: The selected posts have been reported as inappropriate and are unpublished.
th: ข้อความที่เลือกได้ถูกรายงานว่าไม่เหมาะสมและถูกนำออกจากการแสดงผล

source: Site usage statistics
th: สถิติการใช้งานเว็บไซต์

source: Spam protection settings
th: การตั้งค่าการป้องกันสแปม

source: Mollom can be used to block all sorts of spam received by your website. Your Drupal site will send data you want checked for spam to the Mollom servers, which will reply with either 'spam' or 'ham' (not spam). If Mollom is not fully confident in its decision, it will ask the user to fill out a CAPTCHA. On the rare occasion that Mollom asks the poster to fill out a CAPTCHA, Mollom assumes that all legitimate posters will take the extra time to fill out this CAPTCHA. Using the CAPTCHA, Mollom avoids legitimate messages being incorrectly classified as spam and it eliminates the need to moderate messages that Mollom decided to block. Administrators can still inspect the <a href="@logs">logs</a> to see what Mollom has blocked.
th: Mollom ถูกใช้เพื่อบล็อกสแปมที่จะถูกส่งเข้ามาในเว็บไซต์ Drupal ของคุณ โดยเว็บไซต์คุณจะส่งข้อมูลเข้ามาให้ตรวจสอบ และทาง Mollom จะตอบกลับไปว่าข้อความนั้นเป็น "สแปม" หรือ "แฮม" (ไม่ใช่สแปม) ถ้า Mollom ไม่มั่นใจในคำตอบ Mollom จะให้ผู้ใช้กรอก CAPTCHA (ซึ่งทั่วไปการกรอก CAPTCHA ผู้ใช้ทั่วไปจะใช้เวลาเพิ่มเติมในการกรอกเพื่อยืนยันตัวตน) ทาง Mollom ใช้ CAPTCHA ในการตรวจสอบเพื่อยืนยันว่าข้อความนั้นเป็นข้อความจริงไม่ใช่สแปม ซึ่งทางแอดมินยังคงสามารถตรวจสอบ<a href="@logs">บันทึกการบล็อกและการทำงาน</a>ของ Mollom ได้

source: To perform its service, Mollom processes, stores and compares the data submitted by your site's visitors as explained in our <a href="http://mollom.com/service-agreement-free-subscriptions">Web Service Privacy Policy</a>. As the controller of the data being processed, it is your responsibility to inform your website's visitors, and to obtain appropriate consent from them to allow Mollom to process their data.
th: ตามหลักการทำงานของ Mollom ที่เก็บและเปรียบเทียบข้อมูลที่ผู้ใช้งานเว็บไซต์ส่งเข้ามา ตามที่ได้อธิบายไว้ที่ <a href="http://mollom.com/service-agreement-free-subscriptions">นโยบายความเป็นส่วนตัวของเว็บเซอร์วิส</a> เพื่อให้เป็นไปตามข้อตกลง คุณจำเป็นต้องแจ้งผู้ใช้งานเว็บไซต์ และแน่ใจว่าผู้ใช้งานนั้นยอมรับเงื่อนไขเช่นเดียวกัน

source: More information about how Mollom works, is available on the <a href="@mollom-workings">"How Mollom works" page</a> and the <a href="@mollom-faq">Mollom FAQ</a>.
th: ข้อมูลเพิ่มเติมว่า Mollom ทำงานอย่างไรดูได้ที่ <a href="@mollom-workings">"How Mollom works" page</a> และ <a href="@mollom-faq">Mollom FAQ</a>

source: Protect @name
th: ป้องกัน @name

source: Server settings
th: การตั้งค่าเซิร์ฟเวอร์

source: Fallback strategy
th: แผนสำรอง

source: Block all submissions on the protected forms until the server problems are resolved
th: บล็อกข้อความที่ถูกส่งเข้ามาทั้งหมดจนกว่าเซิร์ฟเวอร์จะทำงานตามปกติ

source: Leave all forms unprotected and accept all submissions
th: ปล่อยฟอร์มทั้งหมดไม่ถูกป้องกัน และตกลงรับข้อความทั้งหมด

source: In the very unlikely event that the Mollom servers are down or otherwise unreachable, no text analysis can be performed and no CAPTCHAs can be generated. At that point, your Drupal site will use the configured fallback strategy. You can choose to blindly accept all submissions without spam checking, or you can choose to block all submissions until the server or connection problems are resolved.
th: ในเหตุการณ์สุดวิสัยที่เซิร์ฟเวอร์ Mollom ไม่สามารถใช้งานได้ ระบบจะไม่สามารถวิเคราะห์ข้อความและสร้าง CAPTCHA ในกรณีนี้เว็บไซต์ Drupal ของคุณจะใช้แผนสำรองที่ถูกตั้งไว้ คุณสามารถเลือกที่จะรับข้อความที่ถูกส่งเข้ามาทั้งหมดโดยไม่ผ่านการตรวจสแปม หรือเลือกที่จะบล็อกข้อความที่ถูกส่งเข้ามาทั้งหมดจนกว่าเซิร์ฟเวอร์จะทำงานตามปกติ

source: Mollom access keys
th: แอคเซสคีย์ของ Mollom

source: In order to use Mollom, you need a public and a private key. Visit <a href="http://mollom.com/user">http://mollom.com/user</a> and create a user account to obtain a private and a public access key.
th: ในการใช้งาน Mollom คุณจำเป็นต้องใช้ พับลิกคีย์ และ ไพรเวตคีย์ ให้เข้าเว็บไซต์ <a href="http://mollom.com/user">http://mollom.com/user</a>และสร้างบัญชีเพื่อรับพับลิกคีย์และไพรเวตคีย์

source: Public key
th: พับลิกคีย์

source: The public key is used to uniquely identify you.
th: พับลิกคีย์ใช้สำหรับแสดงตัวตนของคุณ

source: Private key
th: ไพรเวตคีย์

source: The private key is used to prevent someone from hijacking your requests. It is like a password and should never be shared with anyone.
th: ไพรเวตคีย์ถูกใช้เพื่อป้องกันการดักรีเควสต์ของคุณ เปรียบเสมือนเป็นรหัสผ่าน ซึ่งคีย์นี้ไม่ควรใช้ร่วมกับผู้อื่น

source: The spam filter that is installed on this site is currently not available. Per the site's policy, we are unable to accept new submissions until that problem is resolved. Please try resubmitting the form in a couple minutes.
th: ตัวกรองสแปมในเว็บไซต์นี้ไม่สามารถใช้งานได้ ตามนโยบายของเว็บไซต์เราไม่สามารถรับฟอร์มได้เพิ่มเติมจนกว่าระบบจะเปิดใช้ กรุณาส่งฟอร์มใหม่อีกครั้ง

source: Your submission has triggered the installed spam filter and will not be accepted.
th: ข้อความที่คุณได้ส่งเข้ามาได้ขัดกับตัวกรองสแปม ระบบไม่สามารถรับข้อความนี้ได้

source: We are sorry, but the spam filter on this site decided that your submission could be spam. Please fill in the CAPTCHA first.
th: ทางเราขออภัยที่ให้คุณช่วยกรอก CAPTCHA ใหม่อีกครั้ง เนื่องจากข้อความที่คุณใส่เข้ามานั้นใกล้เคียงกับค่าจากที่ตัวกรองสแปมอ่านได้

source: The entered CAPTCHA solution is not correct. We generated a new CAPTCHA so please try again.
th: CAPTCHA ที่ถูกใส่มาไม่ถูกต้อง ทางเราได้สร้าง CAPTCHA ใหม่ขึ้นมาให้คุณลองอีกครั้ง

source: The CAPTCHA field is required.
th: กรุณาใส่ช่อง CAPTCHA

source: Type in the characters shown in the above; if you can't read them, submit the form and a new image will be generated.
th: พิมพ์ตัวอักษรที่ปรากฏด้านบน ถ้าข้อความไม่ชัดทำให้อ่านไม่ได้ ให้กดฟอร์มนี้และภาพใหม่จะถูกสร้างขึ้น

source: We contacted the Mollom servers to verify your keys
th: เราได้ติดต่อเซิร์ฟเวอร์ของ Mollom เพื่อยืนยันคีย์ของคุณ

source: @message: the Mollom services are operating correctly. We are now blocking spam.
th: @message: บริการ Mollom ทำงานได้ตามปกติ ซึ่งทางเราได้บล็อกสแปม

source: @message: your keys do not exist or are no longer valid. Please visit the user settings page on the Mollom website again: <a href="@mollom-user">@mollom-user</a>.
th: @message: คีย์ของคุณไม่ถูกต้อง กรุณาตรวจสอบอีกครั้งจากหน้า setting ในเว็บไซต์ Mollom: <a href="@mollom-user">@mollom-user</a>

source: Mollom was unavailable (servers: %servers, error: @errno - %error_msg)
th: ไม่สามารถใช้งาน Mollom ได้ (เซิร์ฟเวอร์: %servers, ข้อผิดพลาด: @errno - %error_msg)

source: Ham: %message
th: แฮม (ไม่ใช่สแปม): %message

source: Spam: %message
th: สแปม: %message

source: Unsure: %message
th: ไม่แน่ใจ: %message

source: Incorrect CAPTCHA
th: CAPTCHA ไม่ถูกต้อง

source: Correct CAPTCHA
th: CATCHA ถูกต้อง

source: Error @errno: %server - %message - mollom.getServerList
th: ข้อผิดพลาด @errno: %server - %message - mollom.getServerList

source: The list of available Mollom servers was set to @servers.
th: รายชื่อของเซิร์ฟเวอร์ Mollom ที่ใช้งานได้ถูกเซ็ตไว้ที่ @servers

source: Mollom asked to use the next server in the server list.
th: Mollom ขอให้ใช้เซิร์ฟเวอร์ถัดไปในรายชื่อเซิร์ฟเวอร์

source: Error @errno: %server - %message - %method - <pre>@data</pre>
th: ข้อผิดพลาด @errno: %server - %message - %method - <pre>@data</pre>

source: No Mollom servers could be reached or all servers returned an error -- the server list was emptied.
th: ไม่สามารถติดต่อเซิร์ฟเวอร์ Mollom ได้ หรือเซิร์ฟเวอร์ทั้งหมดส่งค่าความผิดพลาดกลับมา -- รายชื่อเซิร์ฟเวอร์ว่าง

source: post with no checking
th: เขียนโดยไม่ต้องตรวจสอบ

source: Report and delete
th: รายงานและลบออก

source: Mollom is a webservice that helps you manage your community.
th: Mollom คือเว็บเซอร์วิซที่ช่วยให้คุณบริหารชุมชนของคุณ

source: Request CAPTCHA
th: เรียก CAPTCHA

source: Tracks content spam statuses.
th: ติดตามสถานะของเนื้อหาสแปม

source: Unique ID of the content.
th: ไอดีเฉพาะสำหรับเนื้อหา

source: Content author's session ID.
th: มีเซชชันไอดีของผู้เขียนอยู่

source: A quality rating assigned to the content to tell whether or not it's spam.
th: เรตคุณภาพถูกกำหนดว่าเนื้อหานี้เป็นสแปมหรือไม่

source: The language(s) that the content might be written in.
th: ภาษาที่การก่อกวนนี้ถูกเขียนขึ้น

source: Protects against comment and contact form spam.
th: ป้องกันต่อสู้กับสแปมจากคอมเมนต์และคอนแทกต์
